Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/travel_and_recreation/travel_to_ireland/student_visas.html.txt.tmx
Source language: en
Languages: ga

source: Student visas to study in Ireland
ga: Víosaí do mhic léinn

source: Travelling to Ireland for study
ga: Taisteal go hÉirinn le staidéar a dhéanamh

source: Citizens of certain countries who wish to pursue a course of study in Ireland must apply for a visa to enter Ireland before they travel here
ga: Ní mór do shaoránaigh ó thíortha áirithe atá ag iarraidh leo cúrsa léinn a dhéanamh in Éirinn iarratas a dhéanamh ar víosa le teacht go hÉirinn sula dtagann siad anseo

source: Information on those who need an entry visa is available in our document: Visa requirements for entering Ireland
ga: Tá an fhaisnéis ar iad siúd nach a bhfuil gá le víosa iontrála ar fáil sa doiciméad: Riachtanais víosa le teacht isteach in Éirinn

source: If you are a non-EEA national coming to study in Ireland you must be enrolled in a full-time course on the Interim List of Eligible Programmes (ILEP)
ga: Má tá tú neamh-LEE náisiúnach ag teacht chun staidéar a dhéanamh in Éirinn caithfidh tú a bheith cláraithe i gcúrsa lánaimseartha ar an Liosta Eatramhach de Chláir Incháilithe (ILEP)

source: You can find out more in our document on the immigration rules for non-EEA students
ga: Is féidir leat tuilleadh a fháil amach inár ndoiciméad maidir leis na rialacha inimirce do mhic léinn neamh-LEE

source: Visa applicants must apply online for their visa - see 'How to apply'
ga: Ní mór d'iarratasóirí víosa iarratas ar-líne le haghaidh a n víosa (féach 'Conas iarratas a dhéanamh')

source: If you wish to study in Ireland for less than 3 months you should apply for a 'C study visa'
ga: Ba chóir duit cur isteach ar ‘Víosa Staidéar C’ má tá sé ar intinn agat staidéar a dhéanamh in Éirinn ar feadh tréimhse níos lú ná trí mhí

source: If your course lasts longer than 3 months, you should apply for a 'D study visa'
ga: Ba chóir duit cur isteach ar ‘Víosa Staidéar D’ má leanfaidh do chúrsa ar aghaidh níos faide ná trí mhí

source: You will need to provide the following with your visa application
ga: Beidh ort na nithe seo a leanas a sholáthar mar aon le d’iarratas ar víosa

source: (Please remember, original documents are required and must be in English or accompanied by a notarised translation):
ga: (Ná déan dearmad le do thoil go bhfuil cáipéisí bunaidh ag teastáil agus go gcaithfidh siad a bheith as Béarla nó aistriúchán deimhnithe ag nótaire a bheith leo):

source: • Letter of acceptance from a recognised school/college/university in Ireland confirming that you have been accepted on a course of study
ga: • Litir ó scoil/coláiste/ollscoil aitheanta in Éirinn ag dearbhú gur glacadh leat le haghaidh cúrsa staidéir

source: This course of study must be full-time (lasting an academic year) and have a minimum of 15 hours per week study time
ga: Caithfidh an cúrsa staidéir a bheith lánaimseartha (a mhairfidh ar feadh na bliana acadúla) agus ní mór 15 uaire staidéir ar a laghad a bheith i gceist in aghaidh na seachtaine

source: • Evidence of your academic ability to pursue the chosen course through the English language (unless it is an English language course)
ga: • Cruthúnas go bhfuil sé d’acmhainn acadúil ionat an cúrsa a roghnaigh tú a dhéanamh trí mheán an Bhéarla (ach amháin más cúrsa Béarla atá ann)

source: • Evidence that the fees for the course have been paid in full
ga: • Fianaise gur íocadh na táillí i leith an chúrsa ina n-iomláine

source: • Evidence that you have enough funds (€7,000) to maintain yourself for the initial part of your stay
ga: • Fianaise go bhfuil go leor airgid agat (€7,000) chun tú féin a chothú i rith chéad chuid na thréimhse a chaithfidh tú anseo

source: • Evidence that you or a sponsor have access to at least €7,000 for each subsequent year of your studies, in addition to the course fees for each of those years
ga: • Fianaise go bhfuil sé ar do chumas nó ar chumas urra €7,000 ar a laghad a rochtain gach bliain ina dhiaidh sin mar aon le costas táillí na gcúrsaí gach aon bhliain

source: • Evidence that you have private medical insurance
ga: • Fianaise go bhfuil árachas míochaine príobháideach agat

source: • An explanation of any gaps in your educational history
ga: • Míniú faoi aon bhearna a bhí i do chuid cúrsaí staidéir

source: • Confirmation that you intend to return to your country of permanent residence when you leave Ireland
ga: • Dearbhú go bhfuil sé ar intinn agat filleadh ar do thír bhuanchónaí nuair a fhágann tú Éire

source: Remember, the granting of a student visa to study in Ireland does not confer the automatic right of anyone to join or visit you in Ireland (whether they are a relative or not)
ga: Ná déan dearmad, má thugtar víosa mic léinn duit le staidéar a dhéanamh in Éirinn nach dtugann sé seo aon cheart as féin d’aon duine eile teacht leat nó cuairt a thabhairt ort in Éirinn (bíodh an té sin gaolmhar leat nó ná bíodh)

source: You will find more detailed information on the exact requirements for a student visa on the website of the Irish Naturalisation and Immigration Service of the Department of Justice and Equality
ga: Is féidir teacht ar faisnéis mhionsonraithe faoin a bhfuil ag teastáil chun víosa mic léinn a fháil ar láithreán gréasáin Seirbhís Eadóirseachta agus Inimirce na hÉireann de chuid na Roinne Dlí agus Cirt agus Comhionannais

source: If I don't need an entry visa to enter Ireland, do I need a student visa to study?
ga: Murar gá dom víosa le dul go hÉirinn an gá dom víosa mic léinn le staidéar sa tír?

source: If you do not require an entry visa to enter Ireland, you do not require a student visa to study in Ireland
ga: Mura bhfuil víosa iontrála riachtanach duit le teacht go hÉirinn ní gá víosa mic léinn le staidéar a dhéanamh anseo

source: However, all non-EEA nationals, including those with visas, must obtain permission to enter the State by reporting to an Immigration Officer at the port of entry
ga: Ní mór do gach duine nach náisiúnach de chuid LEE é nó í, lena n-áirítear daoine le víosaí, cead a fháil teacht isteach sa stát agus é sin a dhéanamh trí dhul i dteagmháil le hOifigeach Inimirce ag an bport iontrála

source: (The members of the EEA are the 28 countries of the European Union (EU), together with Iceland, Norway and Liechtenstein)
ga: (Is iad 28 tír an Aontais Eorpaigh (AE) mar aon leis an Íoslainn, an Iorua, agus Lichtinstéin na tíortha LEE)

source: You should have all documentation relating to your studies on your person when coming through immigration
ga: Ba chóir gach cáipéis a bhaineann le do chuid staidéir a bheith agat nuair a thagann tú tríd inimirce

source: In other words, you should have your letter of offer of a place at the school, or educational institution ready for inspection at immigration
ga: Is é sin le rá gur chóir duit do litir, nó an tairiscint a fuair tú faoi áit a bheith agat i scoil nó in institiúid oideachais, a bheith ullamh agat chun go ndéanfaidh na hoifigigh inimirce í a iniúchadh

source: You can read more in our document on permission to land in Ireland
ga: Féadfaidh tú tuilleadh a léamh inár ndoiciméad faoi cead tuirlingthe in Éirinn

source: Students from a non-EEA country who intend studying in Ireland for a period of more than 3 months must register, after they arrive, with the local immigration officer for the district in which they are living (Burgh Quay Registration Office if living in Dublin)
ga: Maidir le mic léinn ó thíortha nach tíortha LEE iad, agus ar mian leo staidéar a dhéanamh in Éirinn ar feadh tréimhse níos faide ná trí mhí, ní mór dóibh clárú le hoifigeach inimirce an cheantair sin ina bhfuil siad ina gcónaí. (Is é sin Oifig Chlárúcháin Cé an Bhúrcaigh má tá cónaí orthu i mBaile Átha Cliath)

source: Their passport will be endorsed with the conditions and period of time for which they have permission to remain
ga: Formhuineofar a bpasanna leis na coinníollacha faoina bhfuil cead acu fanacht agus an tréimhse ama atá i gceist

source: Students who do not require a visa must have €3,000 when they first register
ga: Maidir le mic léinn nach bhfuil víosa de dhíth acu, ní mór dóibh €3000 a bheith acu nuair atá siad ag clárú

source: Information on what documentation students require when applying for permission is available on the website of the Irish Naturalisation and Immigration Service (INIS)
ga: Is féidir eolas faoi na doiciméid atá riachtanach do mhic léinn nuair atá cead á iarraidh acu a fháil ar láithreán gréasáin Sheirbhís na hÉireann um Eadóirseacht agus Inimirce

source: Non-EEA students coming to Ireland for the first time may not get permission to remain in Ireland if they have their children with them, or intend their children to join them later on
ga: Ní féidir le mic léinn neamh-LEE ag teacht go hÉirinn don chéad uair cead fanachta in Éirinn má tá a gcuid leanaí leo, nó ar intinn acu a gcuid páistí a bheith páirteach leo níos déanaí

source: There is more information about the children of non-EEA students on the INIS website (pdf)
ga: Tá tuilleadh eolais faoi na páistí na mac léinn neamh-LEE ar shuíomh gréasáin SEIÉ (pdf)

source: You can find out how to register in our document on Registration of non-EEA nationals in Ireland
ga: Féadfaidh tú a fháil amach conas clárú inár ndoiciméad faoi Clárú náisiúnach nach náisiúnaigh de chuid LEE iad in Éirinn

source: Access to employment while in Ireland on a student visa
ga: Fostaíocht a fháil nuair atá tú in Éirinn ar víosa mic léinn

source: If you are attending a course on the Interim List of Eligible Programmes (ILEP) you will have stamp number 2 endorsed on your passport when you register with your local immigration officer
ga: Má tú ag freastal ar chúrsa ar an Liosta Eatramhach de Chláir Incháilithe (ILEP), beidh stampa uimhir a 2 formhuinithe ar do phas

source: You will be allowed to take up casual employment of up to 20 hours part-time work per week in term time or up to 40 hours per week during college vacation periods, that is, from June to September inclusive and from 15 December to 15 January
ga: Beidh cead agat breacfhostaíocht de suas go dtí 20 uair sa steachtain in am téarma agus 40 uair sa tseachtain i dtréimhsí saoire choláiste, is é sin, ó Meitheam go Meán Fómhair cuimsitheach agus ó Nollaig 15 go Eanáir 15

source: Your entitlement to take up employment ceases when your permission to remain expires
ga: Scoirfidh do theidlíocht i mbun fostaíochta nuair éagann do chead fanachta

source: If you are not attending such a course, you will not be entitled to take up part-time work or engage in any business or profession
ga: Mura bhfuil tú ag freastal ar a leithéid de chúrsa, ní bheidh tú i dteideal obair pháirtaimseartha nó dul i mbun aon ghnó nó aon ghairm

source: You will get stamp number 2A on your passport
ga: Gheobhaidh tú stampa uimhir 2A ar do phas

source: You can read information on employment rights of part-time workers in Ireland here
ga: Féadfaidh tú tuilleadh faisnéise a léamh faoi cearta fostaíochta oibrithe páirtaimseartha in Éirinn anseo

source: What do I do if I want to leave for a short while?
ga: Cad a dhéanfaidh mé más mian liom a fhágáil ar feadh tamaill ghairid?

source: The visa issued to you allows you to enter the State once
ga: An víosa a eisíodh duit is féidir leat chun teacht isteach sa Stát uair amháin

source: If you wish to leave for a short while and then return you must apply for a re-entry visa
ga: Más mian leat a fhágáil ar feadh tamaill ghearr agus ansin ar ais ní mór duit iarratas a dhéanamh ar víosa athiontrála

source: (See 'How to apply' below for information on how to apply for a re-entry visa.)
ga: (Féach 'Conas iarratas a dhéanamh' thíos le haghaidh eolas ar conas iarratas a dhéanamh ar víosa athiontrála.)

source: It is your responsibility to ensure you have the correct visa (if required) for the country you intend travelling to
ga: Is ortsa atá an fhreagracht a chinntiú go bhfuil tú ar an víosa ceart (más gá) don tír ar intinn agat taisteal go dtí

source: Please note that you must obtain a visa from the UK authorities before travelling to Northern Ireland (Counties Antrim, Armagh, Derry, Down, Fermanagh and Tyrone)
ga: Tabhair faoi deara go gcaithfidh tú víosa ó údaráis na Ríochta Aontaithe a fháil roimh thaisteal go Tuaisceart Éireann (Contaetha Aontroim, Ard Mhacha, Doire, Dún, Fear Manach agus Tír Eoghain)

source: Information on applying for a visa to visit the UK is available from UK Visas and Immigration
ga: Tá eolas ar cur isteach ar víosa chun cuairt a thabhairt ar an Ríocht Aontaithe ar fáil ó Ríocht Aontaithe Víosaí agus Inimirce

source: Information on those who need a visa to visit Ireland is available in our document: Visa requirements for entering Ireland
ga: Eolas ar iad siúd a bhfuil gá le víosa atá ar fáil sa doiciméad: Riachtanais víosa le teacht isteach in Éirinn

source: You do not require a visa if you are from an EU/EEA member state
ga: Ní gá duit víosa a fháil le cuairt a thabhairt ar Éirinn más más saoránach de chuid an AE/LEE tú

source: Standard non-refundable visa application processing fees are:
ga: Is iad seo a leanas na táillí maidir le próiseáil iarratas ar víosaí

source: Certain applicants are not required to pay a fee
ga: Ní gá d’iarratasóirí áirithe aon táille a íoc

source: They include non-EU Spouses of EU citizens
ga: Áirítear leo siúd céilí ar gá dóibh víosaí a bheith acu agus baill theaghlaigh saoránach de chuid an AE/LEE

source: In addition, applicants from some countries are not required to pay a fee
ga: Lena chois sin ní gá d’iarratasóirí ó thíortha áirithe aon táille a íoc

source: As this changes from time to time, you should check with your local Irish embassy or consulate, or with the Visa Office - see 'Where to apply'
ga: Ós rud é go n-athraíonn sé seo ó am go chéile, ba chóir duit ceist a chur ar ambasáid nó ar chonsalacht na hÉireann atá gar duit nó ar an Oifig Víosa - féach ‘Cá háit a dhéanfaidh mé iarratas’

source: Nationals of the countries covered by the Short-stay Visa Waiver Programme who are long-term legal residents of the UK or the Schengen area will still require a visa but will not have to pay the visa fee
ga: Ní gá do náisiúnaigh de na tíortha faoi chumhdach an Chláir Tarscaoilte Víosa Gearrchónaithe, atá ina gcónaí go dlíthiúil sa RA nó sa limistéar Schengen an táille víosa a íoc ach is gá díobh víosa a bheith acu fós

source: You must apply for a visa online
ga: Caithfidh tú iarratas ar víosa a dhéanamh ar líne

source: There is information on how to complete an online application in English (pdf) as well as in Arabic (pdf), Chinese (pdf), Russian (pdf), French (pdf), Turkish (pdf), Hindi (pdf) and Urdu (pdf)
ga: Tá faisnéis faoi conas iarratas a dhéanamh ar líne as Béarla (pdf) agus as Araibis (pdf), as Sínis (pdf), as Rúisis (pdf), as Fraincis (pdf), as Tuircis (pdf), as Hiondúis (pdf) agus as Urdais (pdf)

source: Details of what documents you will need and the photographic requirements are on the INIS website
ga: Tá sonraí faoi na cáipéisí a bheidh ag teastáil uait agus na riachtanais ghrianghrafadóireachta le fáil ar láithreán gréasáin Sheirbhís Eadóirseachta agus Inimirce na hÉireann (SEIÉ)

source: The Irish Government has started collecting biometric data from certain visa applicants
ga: Tosaíonn Rialtas na hÉireann sonraí bithmhéadracha ó iarratasóirí víosa áirithe a bhailiú

source: Since March 2010 all visa applicants aged 6 years and over residing in Nigeria must provide fingerprints
ga: Ó Márta 2010 ní mór do gach iarratasóir víosa atá os cionn aois 6 agus ina chónaí sa Nigéir, méarloirg a sholáthar

source: You can find information about biometric data on the INIS website
ga: Tá tuilleadh eolais faoi shonraí bithmhéadracha ar fáil ar an suíomh gréasáin SEIÉ

source: Detailed information on the application procedures is available on the website of the Irish Naturalisation and Immigration Service (INIS)
ga: Molann Seirbhís Eadóirseachta agus Inimirce na hÉireann go dtabharfá 8 seachtaine ar a laghad chun d’iarratas ar víosa a phróiseáil

source: Applying for a re-entry visas
ga: Cur isteach ar víosaí athiontrála

source: Before applying for a re-entry visa you must register with the local immigration officer for the district in which you are staying
ga: Sula gcuireann tú isteach ar víosa athiontrála ní mór duit clárú le hoifigeach inimirce an cheantair sin ina bhfuil tú i do chónaí

source: You can read more about registration in our document on Registration of non-EEA nationals in Ireland
ga: Féadfaidh tú tuilleadh a léamh faoi chlárú inár ndoiciméad faoi Clárú náisiúnach nach den LEE iad in Éirinn

source: Sent your completed Re-Entry Visa Application Form, along with all required documentation, by registered post to the Re-entry Visa Processing Office - see 'Where to apply' below
ga: Seol an Foirm Iarratais le haghaidh Víosa Athiontrála comhlánaithe mar aon leis an gcáipéisíocht riachtanach go léir trí phost cláraithe chuig:

source: If you wish to apply in person at the Visa Office you must book an appointment online
ga: Oifig Próiseála Víosaí Athiontrála,

source: You will need to have a completed application form and all required documentation with you
ga: Seirbhís Eadóirseachta agus Inimirce na hÉireann, 13-14 Cé an Bhúrcaigh, Baile Átha Cliath 2

source: Apply for your re-entry visa well in advance of your proposed dates of travel
ga: Cuir isteach ar do víosa athiontrála i bhfad roimh na dátaí a bhfuil sé ar intinn agat taisteal

source: Postal applications for re-entry visas will be processed within 4 days of receipt and your re-entry visa will be returned to you by registered post
ga: Déanfar iarratais ar víosaí athiontrála a fhaightear tríd an bpost a phróiseáil laistigh de 4 lá ón am a fhaightear iad, agus cuirfear do víosa athiontrála ar ais chugat trí phost cláraithe

source: There is more information on applying for a re-entry visa, as well as information on photographic requirements on the Irish Naturalisation and Immigration Service website
ga: Más mian leat iarratas a dhéanamh go pearsanta chuig Oifig Víosaí, ní mór duit coinne a chur in áirithe ar líne. Beidh ort foirm iarratais chomhlánaithe agus an cháipéisíocht riachtanach go léir a bheith agat

source: Where to apply Your visa application must be made online
ga: Tá tuilleadh eolais faoi cur isteach ar víosa athiontrála agus faisnéis faoi riachtanais ghrianghrafadóireachta le fáil ar láithreán gréasáin Sheirbhís Eadóirseachta agus Inimirce na hÉireann
